---
kind: method
id: M:Autodesk.Revit.DB.CopyPasteOptions.Dispose
source: html/22c1495d-7d33-953a-6ec9-ae6a006af3e0.htm
---
# Autodesk.Revit.DB.CopyPasteOptions.Dispose Method

Releases all resources used by the CopyPasteOptions

## Syntax (C#)
```csharp
public void Dispose()
```